/*
********************************************************************************
*                              COPYRIGHT NOTICE
*                             Copyright (c) 2016
*                             All rights reserved
*
*  @FileName       : bitmove.c
*  @Author         : scm 351721714@qq.com
*  @Create         : 2017/06/01 23:07:08
*  @Last Modified  : 2017/07/08 23:10:08
********************************************************************************
*/

#include <stdio.h>

//以下的例子说明了正数和负数的位移是不一样的。
//负数右移时无法去掉最高位的1，但是左移却可以去掉最高位的1。
//正数和无符号数的位移是一样的。

int main(int argc, char *argv[])
{
    int i = 0x80000000; //赋值为负数
    int j = 1;

    //正数右移能修改最高位
    printf("%#x\n", 0x80000000 >> 1);
    //正数左移能修改最高位
    printf("%#x\n", 0x80000000 << 1);
    //负数右移不能修改最高位
    printf("%#x\n", i >> 1);
    //负左移能修改最高位
    printf("%#x\n", i << 1);

    return 0;
}
