/*
********************************************************************************
*                              COPYRIGHT NOTICE
*                             Copyright (c) 2016
*                             All rights reserved
*
*  @FileName       : 友元.cpp
*  @Author         : scm 351721714@qq.com
*  @Create         : 2017/06/28 13:50:26
*  @Last Modified  : 2017/06/28 13:59:30
********************************************************************************
*/

/*
 * 一个函数可以同时是多个类的友元函数。
 * 类A是类B的友元类，意味着类A的所有函数都是类B的友元函数。
 * 如果只想让类A中的函数f()成为类B的友元，只需在类B中声明 friend A::f() 即可。
 */
