/*
********************************************************************************
*                              COPYRIGHT NOTICE
*                             Copyright (c) 2016
*                             All rights reserved
*
*  @FileName       : 数组元素求值.c
*  @Author         : scm 351721714@qq.com
*  @Create         : 2017/07/02 14:36:24
*  @Last Modified  : 2017/07/02 15:16:22
********************************************************************************
*/

/*
 * 数组a[N]，存放了1至N-1个元素，其中有一个数重复了一次。写个函数求出这个重复的数字，
 * 要求时间复杂度为O(N)。函数原型：int do_dup(int a[], int n)。
 */

/*
 * 解析：假设有数组a[N]，里面的数从1一直等差递增。则这个数组的所有元素的和为：(a[0] + a[N-1]) * N / 2;
 * a = {1, 2, 3, 4, 5, 6} = Sa;
 * a_ = {6, 5, 4, 3, 2, 1} = Sa_;
 * --> Sa == Sa_ == (a[0] + a_[0]) * N / 2 == (a[0] + a[N-1]) * N / 2;
 *  由以上分析可知，假如去掉这个重复的数字，则得到一个等差弟增数组，则这个数组所有元素的和为：
 *  sum = (第一个元素值 + 最后一个元素值) * 元素数量 / 2 = (1 + (N-1)) * (N - 1) / 2;
 */

int do_dup(int a[], int N)
{
    int s = N * (N - 1) / 2; //求去掉重复数字后的等差弟增数组的和。
    int sum = 0;
    for(int i = 0; i < N; ++i)
        sum += a[i];        //求原数组的和。
    return sum - s;
}
