/*
********************************************************************************
*                              COPYRIGHT NOTICE
*                             Copyright (c) 2016
*                             All rights reserved
*
*  @FileName       : 补码.c
*  @Author         : scm 351721714@qq.com
*  @Create         : 2017/06/02 00:10:10
*  @Last Modified  : 2017/06/28 14:02:18
********************************************************************************
*/

#include <stdio.h>

//正数的原码、反码、补码都相等。
//负数的反码等于除符号位以外都取反
//负数的补码等于反码加1

//如下:
//char a = 1, [10进制+1] = [原码 0000 0001] = [反码 0000 0001] = [补码 0000 0001]
//char a = -1, [10进制-1] = [原码 1000 0001] = [反码 1111 1110] = [补码 1111 1111]

//在计算计中数据都是以补码的形式存在，原因在于计数机中没有减法器，通过补码的形式把
//减法转化成加法。如下：
// 2 - 1 = 2 + (-1) = [0000 0010] + [1111 1111] = [0000 0001] = 1

